In [571]:
import pandas as pd

In [572]:
import numpy as np

In [573]:
label = ['cat', 'dog', 'dog', 'bird', 'cat']
animal = ['meow meow', 'bark bark', 'human best friend', 'pair of wings', '9 lives']
link = pd.Series(data=animal, index=label);
link

cat             meow meow
dog             bark bark
dog     human best friend
bird        pair of wings
cat               9 lives
dtype: object

In [574]:
# pass in two python list, one is the data list, another is the index
link1 = pd.Series(animal, label)
link1

cat             meow meow
dog             bark bark
dog     human best friend
bird        pair of wings
cat               9 lives
dtype: object

In [575]:
# pass in the numpy array
npArr = np.array(animal)
pd.Series(npArr)

0            meow meow
1            bark bark
2    human best friend
3        pair of wings
4              9 lives
dtype: object

In [576]:
pd.Series(npArr, label)

cat             meow meow
dog             bark bark
dog     human best friend
bird        pair of wings
cat               9 lives
dtype: object

In [577]:
# pass in the dictionary too (# but dictionary won't allow duplicated key)
dic = { "cat":"meow", "dog":"bark", "dog":"loyal", "bird":"wings", "cat":"immortal"}
pd.Series(dic)

cat     immortal
dog        loyal
bird       wings
dtype: object

In [578]:
# retreive data from a series with label

In [579]:
series1 = pd.Series(['John', 'Mary', 'Kate'], [1,2,3])
print(series1[3])

Kate

In [580]:
series1 = pd.Series([1,2,3], ['John', 'Mary', 'Kate'])
print(series1['Mary'])

2

In [581]:
seriesA = pd.Series(['Apple', 'Banana', 'Pear'], [10,12,10] )
seriesB = pd.Series(['Apple', 'Banana', 'Pear', 'Grape'], [5,0,8,38])
seriesC = seriesA + seriesB
seriesC # 2 series with different label for the same data just doesn't make sense

0     NaN
5     NaN
8     NaN
10    NaN
10    NaN
12    NaN
38    NaN
dtype: object

In [582]:
seriesA = pd.Series(['Apple', 'Banana', 'Pear'], [10,12,10] )
seriesB = pd.Series(['Apple', 'Banana', 'Pear', 'Grape'], [10,12,10,38])
seriesC = seriesA + seriesB
seriesC # merge the data with the same label, while the data only exist in one series will be "NaN"

10      AppleApple
10       ApplePear
10       PearApple
10        PearPear
12    BananaBanana
38             NaN
dtype: object

In [583]:
seriesA = pd.Series([2,32,0], ['Apple', 'Banana', 'Pear'])
seriesB = pd.Series([16,18,10,38], ['Apple', 'Banana', 'Pear', 'Grape'])
seriesC = seriesA + seriesB 
seriesC # merge the data (sum the qty) with the same label (i.e. 'Apple", "Banna" ...etc.) , while the data only exist in one series will be "NaN"

Apple     18.0
Banana    50.0
Grape      NaN
Pear      10.0
dtype: float64

In [584]:
np.random.seed(101)

In [585]:
dataF = pd.DataFrame(np.random.rand(5,4), ['A', 'B', 'C', 'D', 'E'], ['S', 'T', 'W', 'Z'])

In [586]:
dataF

          S         T         W         Z
A  0.516399  0.570668  0.028474  0.171522
B  0.685277  0.833897  0.306966  0.893613
C  0.721544  0.189939  0.554228  0.352132
D  0.181892  0.785602  0.965483  0.232354
E  0.083561  0.603548  0.728993  0.276239

In [587]:
inputArr = np.arange(1, 21).reshape(5,4)
inputArr

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20]])

In [588]:
dataF = pd.DataFrame(inputArr, ['row1', 'row2','row3', 'row4','row5'], ['col1','col2','col3','col4'])
dataF

      col1  col2  col3  col4
row1     1     2     3     4
row2     5     6     7     8
row3     9    10    11    12
row4    13    14    15    16
row5    17    18    19    20

In [589]:
# return each colume of values as a series
serieCol1 = dataF['col1']
serieCol1

row1     1
row2     5
row3     9
row4    13
row5    17
Name: col1, dtype: int32

In [590]:
# to "prove" it is a serie
type(serieCol1)

pandas.core.series.Series

In [591]:
type(dataF)

pandas.core.frame.DataFrame

In [592]:
# or you can just directly type colume name as attribute
dataF.col1

row1     1
row2     5
row3     9
row4    13
row5    17
Name: col1, dtype: int32

In [593]:
# get multiple column data by inputing a list of colume names
result1 = dataF[['col1', 'col2']]
result1

      col1  col2
row1     1     2
row2     5     6
row3     9    10
row4    13    14
row5    17    18

In [594]:
type(result1) # check if it is dataframe

pandas.core.frame.DataFrame

In [595]:
# you can also return any rows of a data frame
serieRow1 = dataF.loc['row3']
serieRow1

col1     9
col2    10
col3    11
col4    12
Name: row3, dtype: int32

In [596]:
type(serieRow1) # it is also a serie

pandas.core.series.Series

In [597]:
# you can also return multiple rows of a data frame
dataFRow35 = dataF.loc[['row3','row5']]
dataFRow35

      col1  col2  col3  col4
row3     9    10    11    12
row5    17    18    19    20

In [598]:
type(dataFRow35) # it is a data frame also

pandas.core.frame.DataFrame

In [599]:
# you can also return the row by index
dataF.iloc[2] # corresponding to row 3

col1     9
col2    10
col3    11
col4    12
Name: row3, dtype: int32

In [600]:
# create a new colume as a result of suming other colume
dataF['Sum'] = dataF['col1'] + dataF['col2'] + dataF['col3'] + dataF['col4']
dataF

      col1  col2  col3  col4  Sum
row1     1     2     3     4   10
row2     5     6     7     8   26
row3     9    10    11    12   42
row4    13    14    15    16   58
row5    17    18    19    20   74

In [601]:
# you can drop row or column
# drop row
newDF = dataF.drop('row4',axis=0) # axis = 0 mean row
newDF

      col1  col2  col3  col4  Sum
row1     1     2     3     4   10
row2     5     6     7     8   26
row3     9    10    11    12   42
row5    17    18    19    20   74

In [602]:
# please note it doesn;t affect the original "dataF" data frame
dataF

      col1  col2  col3  col4  Sum
row1     1     2     3     4   10
row2     5     6     7     8   26
row3     9    10    11    12   42
row4    13    14    15    16   58
row5    17    18    19    20   74

In [603]:
newDF = newDF.drop('col2', axis=1)
newDF

      col1  col3  col4  Sum
row1     1     3     4   10
row2     5     7     8   26
row3     9    11    12   42
row5    17    19    20   74

In [604]:
# please note that the values of "Sum" hasn't changed even though "col2" has dropped.
# therefore, need to recalculate the sum once more time.
newDF['Sum'] = newDF['col1'] + newDF['col3']+ newDF['col4']
newDF

      col1  col3  col4  Sum
row1     1     3     4    8
row2     5     7     8   20
row3     9    11    12   32
row5    17    19    20   56

In [605]:
dataF

      col1  col2  col3  col4  Sum
row1     1     2     3     4   10
row2     5     6     7     8   26
row3     9    10    11    12   42
row4    13    14    15    16   58
row5    17    18    19    20   74

In [606]:
# DF's "Sum" value hasn't changed
# if the changes needed to make to the orginal data frame, you need to do the following:
dataF.drop('col2', axis=1, inplace=True) # add "inplace=True" parameter
dataF

      col1  col3  col4  Sum
row1     1     3     4   10
row2     5     7     8   26
row3     9    11    12   42
row4    13    15    16   58
row5    17    19    20   74

In [607]:
dataF.shape # it return a tuple for how many rows and columns

(5, 4)

In [608]:
# you can retreive one of the values in the data frame
# for exmaple, assume we want to get the data at (row3, col4)
dataF.loc['row3','col4']

12

In [609]:
# we can get the subset of the data frame
# for example, we want to retrieve the data which are row 3 and row5, and col1, col3 and sum
dataF.loc[['row3', 'row5'], ['col1', 'col3', 'Sum']]

      col1  col3  Sum
row3     9    11   42
row5    17    19   74

In [610]:
dataF

      col1  col3  col4  Sum
row1     1     3     4   10
row2     5     7     8   26
row3     9    11    12   42
row4    13    15    16   58
row5    17    19    20   74

In [611]:
dataF['col2'] = dataF['col1'] + 1
dataF

      col1  col3  col4  Sum  col2
row1     1     3     4   10     2
row2     5     7     8   26     6
row3     9    11    12   42    10
row4    13    15    16   58    14
row5    17    19    20   74    18

In [612]:
# condtion selection
# i.e. return a new data frame from an original data frame based on some condition
# example
evenDataF = dataF % 2 == 0   #select the even values
evenDataF

       col1   col3  col4   Sum  col2
row1  False  False  True  True  True
row2  False  False  True  True  True
row3  False  False  True  True  True
row4  False  False  True  True  True
row5  False  False  True  True  True

In [613]:
newResult = dataF[evenDataF]
newResult

      col1  col3  col4  Sum  col2
row1   NaN   NaN     4   10     2
row2   NaN   NaN     8   26     6
row3   NaN   NaN    12   42    10
row4   NaN   NaN    16   58    14
row5   NaN   NaN    20   74    18

In [614]:
dataF

      col1  col3  col4  Sum  col2
row1     1     3     4   10     2
row2     5     7     8   26     6
row3     9    11    12   42    10
row4    13    15    16   58    14
row5    17    19    20   74    18

In [615]:
dataF[dataF % 2 == 0]

      col1  col3  col4  Sum  col2
row1   NaN   NaN     4   10     2
row2   NaN   NaN     8   26     6
row3   NaN   NaN    12   42    10
row4   NaN   NaN    16   58    14
row5   NaN   NaN    20   74    18

In [616]:
# also can filter a column based on certain condition
dataF['Sum'] > 30

row1    False
row2    False
row3     True
row4     True
row5     True
Name: Sum, dtype: bool

In [617]:
filteredDF = dataF[dataF['Sum'] > 30]
filteredDF

      col1  col3  col4  Sum  col2
row3     9    11    12   42    10
row4    13    15    16   58    14
row5    17    19    20   74    18

In [618]:
filteredDF['Sum']

row3    42
row4    58
row5    74
Name: Sum, dtype: int32

In [619]:
# or we can do it in one go
dataF[dataF['Sum'] > 30]['Sum']

row3    42
row4    58
row5    74
Name: Sum, dtype: int32

In [620]:
dataF[dataF['Sum'] > 30][['Sum','col4']] # multiple columns

      Sum  col4
row3   42    12
row4   58    16
row5   74    20

In [621]:
dataF

      col1  col3  col4  Sum  col2
row1     1     3     4   10     2
row2     5     7     8   26     6
row3     9    11    12   42    10
row4    13    15    16   58    14
row5    17    19    20   74    18

In [622]:
# if the filtering conditions involves the use of logical "and"/"or", please avoid use the ordinary "and"/"or"
# it is because, for example, the expression "dataF['Sum'] > 30" will return multiple boolean results all at once.
# so if you "dataF['Sum'] > 30 and dataF['col3'] > 2" will actually became " [true,true,false,true] and [false,true,false,true]" which can't be evaluated.
# therefore, use "&' instead of "and", "|" instead of "or"
dataF[ (dataF['Sum'] > 30) & (dataF['col4'] > 15)]

      col1  col3  col4  Sum  col2
row4    13    15    16   58    14
row5    17    19    20   74    18

In [623]:
dataF[ (dataF['Sum'] > 50) | (dataF['col3'] < 10)]

      col1  col3  col4  Sum  col2
row1     1     3     4   10     2
row2     5     7     8   26     6
row4    13    15    16   58    14
row5    17    19    20   74    18

In [624]:
dataF.reset_index()

  index  col1  col3  col4  Sum  col2
0  row1     1     3     4   10     2
1  row2     5     7     8   26     6
2  row3     9    11    12   42    10
3  row4    13    15    16   58    14
4  row5    17    19    20   74    18

In [625]:
dataF.reset_index(inplace=True)

In [626]:
dataF

  index  col1  col3  col4  Sum  col2
0  row1     1     3     4   10     2
1  row2     5     7     8   26     6
2  row3     9    11    12   42    10
3  row4    13    15    16   58    14
4  row5    17    19    20   74    18

In [627]:
newIndexList = 'CA NY WY OR CO'.split()

In [628]:
newIndexList

['CA', 'NY', 'WY', 'OR', 'CO']

In [629]:
# create a new column with a list
dataF["States"] = newIndexList
dataF

  index  col1  col3  col4  Sum  col2 States
0  row1     1     3     4   10     2     CA
1  row2     5     7     8   26     6     NY
2  row3     9    11    12   42    10     WY
3  row4    13    15    16   58    14     OR
4  row5    17    19    20   74    18     CO

In [630]:
# then use the new column as the new index
dataF.set_index('States', inplace=True)
dataF

       index  col1  col3  col4  Sum  col2
States
CA      row1     1     3     4   10     2
NY      row2     5     7     8   26     6
WY      row3     9    11    12   42    10
OR      row4    13    15    16   58    14
CO      row5    17    19    20   74    18

In [631]:
dataF

       index  col1  col3  col4  Sum  col2
States
CA      row1     1     3     4   10     2
NY      row2     5     7     8   26     6
WY      row3     9    11    12   42    10
OR      row4    13    15    16   58    14
CO      row5    17    19    20   74    18

In [632]:
# use zip function to a iterator combined from 2 list. For details, please check https://realpython.com/python-zip-function/
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
zipIterator = zip(outside,inside)
result = list(zipIterator)
print(result)  
print(tuple(zipIterator)) # this will be empty because the iterator already iterating over the end
print(type(result)) # see explanation here: https://stackoverflow.com/questions/66285935/why-return-empty-list-when-calling-list-on-zip-twice

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]
()
<class 'list'>

In [633]:
# MultiIndex: higher dimension indexing ==> https://pandas.pydata.org/docs/user_guide/advanced.html

In [634]:
hierarchIndex = pd.MultiIndex.from_tuples(result)
hierarchIndex

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [635]:
dataArray = np.random.rand(6,2)
dataArray

array([[0.68530633, 0.51786747],
       [0.04848454, 0.13786924],
       [0.18696743, 0.9943179 ],
       [0.5206654 , 0.57878954],
       [0.73481906, 0.54196177],
       [0.91315356, 0.80792015]])

In [636]:
newDf = pd.DataFrame(dataArray, hierarchIndex, ['A','B'])

In [637]:
newDf # a 3-dimension of data (i,e (1 to 3),(A to B),(G1 to G2))

             A         B
G1 1  0.685306  0.517867
   2  0.048485  0.137869
   3  0.186967  0.994318
G2 1  0.520665  0.578790
   2  0.734819  0.541962
   3  0.913154  0.807920

In [638]:
newDf['A']

G1  1    0.685306
    2    0.048485
    3    0.186967
G2  1    0.520665
    2    0.734819
    3    0.913154
Name: A, dtype: float64

In [639]:
newDf.loc['G1']

          A         B
1  0.685306  0.517867
2  0.048485  0.137869
3  0.186967  0.994318

In [640]:
newDf.loc['G1']['A']

1    0.685306
2    0.048485
3    0.186967
Name: A, dtype: float64

In [641]:
temp = newDf.loc['G1']
type(temp)

pandas.core.frame.DataFrame

In [642]:
temp.loc[2] # be carefull not typing .loc['2'] as the key is number not char

A    0.048485
B    0.137869
Name: 2, dtype: float64

In [643]:
newDf

             A         B
G1 1  0.685306  0.517867
   2  0.048485  0.137869
   3  0.186967  0.994318
G2 1  0.520665  0.578790
   2  0.734819  0.541962
   3  0.913154  0.807920

In [644]:
# to give a name to the dimension of (G1, G2) and the dimensin of (1,2,3)
newDf.index.names = ['Groups','Num']
newDf

                   A         B
Groups Num
G1     1    0.685306  0.517867
       2    0.048485  0.137869
       3    0.186967  0.994318
G2     1    0.520665  0.578790
       2    0.734819  0.541962
       3    0.913154  0.807920

In [645]:
newDf.index.names = ['Grps','level']
newDf

                   A         B
Grps level
G1   1      0.685306  0.517867
     2      0.048485  0.137869
     3      0.186967  0.994318
G2   1      0.520665  0.578790
     2      0.734819  0.541962
     3      0.913154  0.807920

In [646]:
# to grab any data, just locate the data from top hierarch to the bottom
newDf.loc['G2'].loc[2]['B']

0.5419617722295935

In [647]:
newDf.index.names = ['Grps','ID']
newDf

                A         B
Grps ID
G1   1   0.685306  0.517867
     2   0.048485  0.137869
     3   0.186967  0.994318
G2   1   0.520665  0.578790
     2   0.734819  0.541962
     3   0.913154  0.807920

In [648]:
# directly grab data for particular level
# e.g. suppose I want to get all the data for ID = 3.
newDf.xs(3, level='ID')

             A         B
Grps
G1    0.186967  0.994318
G2    0.913154  0.807920

In [649]:
newDf.xs('G1', level='Grps')

           A         B
ID
1   0.685306  0.517867
2   0.048485  0.137869
3   0.186967  0.994318

In [650]:
# construct data frame with dictionary

In [651]:
allEmployees = { "names":["John", "Peter", "Marry"], "Salary":[25000, 17000, 30000], "position":["clerk", "manager", "CEO"] }
df = pd.DataFrame(allEmployees)
df

   names  Salary position
0   John   25000    clerk
1  Peter   17000  manager
2  Marry   30000      CEO

In [652]:
# missing values

In [653]:
allEmployees = { "names":[np.nan, "Peter", np.nan], "Salary":[25000, 17000, 30000], "position":[np.nan, "manager", "CEO"] }
df = pd.DataFrame(allEmployees)
df

   names  Salary position
0    NaN   25000      NaN
1  Peter   17000  manager
2    NaN   30000      CEO

In [654]:
df.dropna(axis=0) # drop any row with a nan value

   names  Salary position
1  Peter   17000  manager

In [655]:
df.dropna(axis=1) # drop any column with a nan value

   Salary
0   25000
1   17000
2   30000

In [656]:
df.dropna(axis= 0, thresh=2) #the row with less than 2 non-nan values will be dropped.

   names  Salary position
1  Peter   17000  manager
2    NaN   30000      CEO

In [657]:
allEmployees = { "names":["Sam", "Peter", "Marry", "Average"], "Salary":[25000, 17000, 30000, np.nan], "position":["clerk", np.nan, "CEO", "Not applicable"] }
df = pd.DataFrame(allEmployees)
df

     names   Salary        position
0      Sam  25000.0           clerk
1    Peter  17000.0             NaN
2    Marry  30000.0             CEO
3  Average      NaN  Not applicable

In [658]:
df.fillna(value="default value") # fill in all the "NaN" value with the now "default value"

     names         Salary        position
0      Sam        25000.0           clerk
1    Peter        17000.0   default value
2    Marry        30000.0             CEO
3  Average  default value  Not applicable

In [659]:
df['Salary'].fillna(value=df['Salary'].mean())

0    25000.0
1    17000.0
2    30000.0
3    24000.0
Name: Salary, dtype: float64

In [660]:
# Group By statement (just like sql)
Orderdic = { "Customer Name":["John", "Sam", "John", "Mary", "Peter", "Sam", "Rob"], "Sales":[100, 200, 300, 600, 13, 66, 80], "Qty":[2,1,2,4,3,5,8], "sales channel":["amazon", "aliExpress", "temu", "shein", "aliExpress", "amazon", "temu"]}
df = pd.DataFrame(Orderdic)
df

  Customer Name  Sales  Qty sales channel
0          John    100    2        amazon
1           Sam    200    1    aliExpress
2          John    300    2          temu
3          Mary    600    4         shein
4         Peter     13    3    aliExpress
5           Sam     66    5        amazon
6           Rob     80    8          temu

In [661]:
grpData =  df.groupby("Customer Name")

In [662]:
grpData

In [663]:
grpData.sum() # for the numerical column (i.e "Sales" and "Qty"), the values are summed up. For the "sales channel", it simply merge the string up

               Sales  Qty     sales channel
Customer Name
John             400    4        amazontemu
Mary             600    4             shein
Peter             13    3        aliExpress
Rob               80    8              temu
Sam              266    6  aliExpressamazon

In [664]:
grpData.mean() # the mean value of the numerical colume. However, if it contains the string column (i.e. sales channel).

TypeError: agg function failed [how->mean,dtype->object]

In [ ]:
df

In [ ]:
df[["Customer Name", "Sales", "Qty"]]

In [ ]:
group = df[["Customer Name", "Sales", "Qty"]].groupby("Customer Name")
group

In [ ]:
group.mean()

In [ ]:
group.sum()

In [ ]:
df

In [667]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [668]:
salesDF = pd.DataFrame(data)

In [669]:
salesDF

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [670]:
grp = salesDF.groupby('Company')

In [671]:
type(grp)

pandas.core.groupby.generic.DataFrameGroupBy

In [ ]:
grp.mean()

In [ ]:
df = salesDF[["Company", "Sales"]]
df

In [ ]:
grp = df.groupby("Company")
grp.mean()

In [ ]:
grp.sum()

In [ ]:
grp.sum().loc['FB'] # to return the sales sum of the Compnay

In [ ]:
grp.count()

In [ ]:
grp.min()

In [ ]:
grp.std()

In [ ]:
grp.max()

In [ ]:
df

In [ ]:
df.groupby('Company').describe() # it display various statistically data

In [ ]:
df.groupby('Company').describe().transpose()

In [ ]:
# concate serveral dataframes together

In [ ]:
df1 = pd.DataFrame({ "A":[1, 2, 3], "B":['a', 'b', 'c'], "C":[10, 20, 30]}, index=[100, 200, 300])
df2 = pd.DataFrame({ "A":[100, 200, 300], "B":['A', 3, 'C'], "C":[-10, -20, -30]}, index=[1,2,3])
# df1 = pd.DataFrame({ "A":[1, 2, 3], "B":['a', 'b', 'c'], "C":[10, 20, 30]})
# df2 = pd.DataFrame({ "A":[100, 200, 300], "B":['A', 3, 'C'], "C":[-10, -20, -30]})

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.concat([df1, df2])

In [ ]:
pd.concat([df1, df2], axis=1)

In [ ]:
df1 = pd.DataFrame({ "A":[1, 2, 3], "B":['a', 'b', 'c'], "C":[10, 20, 30]})
df2 = pd.DataFrame({ "A":[100, 200, 300], "B":['A', 3, 'C'], "C":[-10, -20, -30]})
pd.concat([df1, df2], axis=1)

In [ ]:
df1 = pd.DataFrame({ "OrderID":[1,2,3,4,5], "CustomerID":[3, 2, 3, 1, 2], "Buy qty":[3, 4, 5, 8, 2], "sales":[100, 20, 308, 30, 59]})
df2 = pd.DataFrame({ "CustomerID":[1, 2, 3], "Name":['John', 'Marry', 'Joe'], "age":[23, 50, 30]})
pd.merge(df1, df2, how='inner', on='CustomerID') # inner join two table like sql

In [ ]:
df1

In [ ]:
df2

In [ ]:
df1 = pd.DataFrame({ "OrderID":[1,2,3,4,5], "CustomerID":[3, 2, 3, 1, 2], "Buy qty":[3, 4, 5, 8, 2], "sales":[100, 20, 308, 30, 59]},
                   index=[1, 2, 3, 4, 5])
df2 = pd.DataFrame({ "ID":[1, 2, 3], "Name":['John', 'Marry', 'Joe'], "age":[23, 50, 30]},
                   index=[1, 2, 3])
df1.join(df2)

In [ ]:
# some operation

In [ ]:
df = pd.DataFrame({"OrderID": [1, 2, 3, 4, 5, 6],
                  "Customer ID": [3, 4, 5, 3, 7, 8],
                   "Sales": [100, 130, 500, 280, 380, 110]})
df.head() # return first 5 rows only

In [ ]:
# return the distinct value of a particular column
df["Customer ID"].unique()

In [ ]:
# get how many distinct values
len(df["Customer ID"].unique())

In [ ]:
# or you can use "nunique" function to return how many distinct values
df["Customer ID"].nunique()

In [ ]:
# count how often (frequency) a value appear
df["Customer ID"].value_counts()

In [ ]:
# using conditional statement to filter out the record
df

In [ ]:
df[df["Sales"] > 300] # return all order with sales greater than 500

In [ ]:
df[ (df["Sales"] > 200)]

In [ ]:
df[ (df["Sales"] > 200) & ( df["OrderID"]%2 == 0  ) ] # return all order with sales greater than 500

In [ ]:
df

In [ ]:
df["Sales"].sum()

In [ ]:
# you can write a function to act on the data instead of just using some predefined function like "sum" above

In [ ]:
def dividBy(colVal):
    return colVal/100;
df["Sales"].apply(dividBy)

In [ ]:
# using lamda function applied to the 
df["Sales"].apply(lambda x: x/100)

In [ ]:
df

In [ ]:
# drop specific row
df.drop([1, 4], axis=0) # drop row with index = 1 and 4

In [ ]:
# drop specific column
df.drop(["OrderID", "Customer ID"], axis=1) # drop column "OrderID" and "Customer ID"

In [ ]:
df

In [ ]:
df.columns # return all the columns name

In [ ]:
df.index # return the row index

In [ ]:
# sort the dataframe by "Sales" value
df.sort_values("Sales")

In [ ]:
df.sort_values(by="Sales")

In [ ]:
df.sort_values(by="Sales", ascending=False) # sort by descending order

In [ ]:
# return any null data
allEmployees = { "names":["Sam", "Peter", "Marry", "Average"], "Salary":[25000, 17000, 30000, np.nan], "position":["clerk", np.nan, "CEO", "Not applicable"] }
emdf = pd.DataFrame(allEmployees)
emdf

In [ ]:
emdf.isnull() # return any null data

In [ ]:
sales = pd.DataFrame({ "Region":["North America", "Asia",     "Asia",    "North America", "Europe", "Asia",  "Europe",  "North America", "Europe"], 
          "Country":["US",           "Japan", "South Korea",   "Canda",       "UK",    "Japan", "Germany",  "US",            "UK"],
          "Year":[   2022,            2022,    2023,            2023,         2022,     2023,    2022,       2023,            2023  ],
          "Sales Platform":["Amazon", "AliExpress", "Amazon", "Temu", "Amazon", "AliExpress", "Temu", "Amazon",  "AliExpress"],
          "Sales":[500, 3200, 600, 4230, 6100, 680, 100, 5800, 5600]
        })
sales

In [ ]:
sales.pivot_table(values="Sales", index=["Region", "Country"], columns=["Year"])

In [ ]:
sales.pivot_table(values="Sales", index=["Region", "Country"]) # the sales is by default the mean values of the sales

In [ ]:
sales.pivot_table(values="Sales", index=["Region"]) # the sales is by default the mean values of the sales

In [ ]:
# if you want to get the sales as the total sum, you need to specify the "aggfunc='sum' "
sales.pivot_table(values="Sales", index=["Region"], aggfunc='sum')

In [ ]:
sales.pivot_table(values="Sales", index=["Region", "Country"], aggfunc='sum') # the sales is by default the mean values of the sales